{
  "peft_type": "LORA",
  "auto_mapping": null,
  "base_model_name_or_path": "stabilityai/stable-diffusion-xl-base-1.0",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "r": 16,
  "revision": null,
  "target_modules": [
    "to_k",
    "to_q",
    "to_v",
    "to_out.0",
    "proj_in",
    "proj_out",
    "ff.net.0.proj",
    "ff.net.2"
  ],
  "task_type": "FEATURE_EXTRACTION"
}